Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: on the calculator, it will be instantly understood that the sum sin
nb: på kalkulatoren vil man enkelt se at summen sin

source: The researchers have noted similarities and differences in 24 ECEC institutions in Norway, Sweden, Denmark, Finland and Iceland.
nb: Forskerne har sett etter likheter og forskjeller i 24 barnehager i Norge, Sverige, Danmark, Finland og Island.

source: read and understand simple tables and graphic presentations
nb: lese og forstå enkle tabeller og grafiske framstillinger

source: participate in exploratory conversations on literature, drama and film
nb: delta i utforskende samtaler om litteratur, teater og film med spesiell vekt på døvekultur

source: When pupils work together with adults or each other, the diversity of abilities and talents may strengthen the community and the learning and development of the individual.
nb: Når elever arbei­der sammen med voksne og med hverandre, kan mangfoldet av evner og talenter bidra til å styrke både fel esskapets og den enkeltes læring og utvikling.

source: discuss content and form in composite texts
nb: beskrive likheter og forskjeller mellom døvekultur og norsk kultur før og nå

source: If they don’t, they are unable to have
nb: Hvis de ikke gjør det, kan de ikke

source: Production and labour
nb: produksjon og arbeid

source: The schools must also have
nb: Skolene skal også ha en videre plan der de bl.a.

source: Teaching in the programme subjects shall provide the basis for lifelong learning and help develop technical understanding and professional vocational practice.
nb: Opplæringen i programfagene skal legge grunnlaget for livslang læring og bidra til å utvikle faglig forståelse og profesjonell yrkesutøvelse.

source: Indirectly, they were concerned with democracy as a value.
nb: Dessuten var de indirekte opptatt av verdien demokrati.

source: talk about some persons, places and events in English-speaking countries
nb: fortelle om ulike hørende og døve personer, steder og begivenheter fra engelskspråklige land

source: explore, draw and describe geometric figures from one’s own
nb: utforske, tegne og beskrive geometriske figurer fra sitt eget nærmiljø

source: recognise Judaic art and make use of aesthetic expressions related to Judaism
nb: gjenkjenne kunst og gjøre bruk av estetiske uttrykk knyttet til jødedommen

source: The goal is not to avoid rules in kindergarten, but for staff to continuously re-evaluate the rules, reasons and restrictions again and again.’
nb: Målet er ikke å unngå regler i barnehagen, men at personalet stadig må tenke over regelen, grunnlaget og avgrensinger på nytt og på nytt.

source: read and understand texts of different lengths and genres
nb: lese og forstå tekster av ulik lengde og i flere sjangere

source: It is found in most social arenas such as sports, cultural activities and cultural institutions, elder care, child and adolescent work, at organizations and in politics.
nb: Frivillig arbeid har lange tradisjoner i Norge og foregår innenfor samfunnsområder som idrett, kulturliv, eldreomsorg, barne- og ungdomsarbeid, organisasjonsliv og politikk.

source: in the natural science subject means using numbers and calculations to register and calculate results from one's own measurements and to prepare tables and graphs with natural science content.
nb: i naturfag er å bruke tall og beregninger for å registrere og utarbeide resultater fra ens egne målinger og å lage tabeller og diagrammer med naturfaglig innhold.

source: Professor Ingunn Størksen headed the study.
nb: Professor Ingunn Størkersen ledet studien.

source: It was just one of those things that happen in all the excitement over the technology,’ Jernes adds.
nb: Det var bare noe som skjedde i begeistringen over teknologien, mener Jernes.

source: reflect on and give examples of how words and pictures work together in different media
nb: reflektere over og gi eksempler på hvordan ord og bilde virker sammen i ulike medier

source: Consequently, they often use tools when evaluating children.
nb: Derfor benytter de seg ofte av hjelpemidler når de skal vurdere barn.

source: talk about the use of irony and humour in language
nb: samtale om bruk av ironi og humor i språket

source: in Basic Norwegian for language minorities involves mastering new kinds of text and forms of expression.
nb: i grunnleggende norsk for språklige minoriteter innebærer å mestre nye tekstformer og uttrykksmåter.

source: Then Robin moves over and sits on the blanket with Sofie.
nb: Da kommer Robin og setter seg på teppet sammen med Sofie.

source: But upon entering a new and unaccustomed situation, they started to wander why something felt unusual.
nb: Men når de kom i en ny og uvant situasjon, begynte de å reflektere over hvorfor noe føles uvant.

source: The next step is for pupils to train their ability to search for information independently, compare information from different sources and evaluate the information critically as to credibility and purpose.
nb: Senere kommer oppøving av evnen til å gjøre egne informasjonssøk, sammenlikne informasjon fra ulike kilder og kritisk vurdere deres relevans, troverdighet og formål.

source: ‘No previous studies have been undertaken to determine how similar or different the attitudes of parents and early childhood educators are on specific pedagogical issues.
nb: – Det har ikke tidligere vært undersøkt hvor like eller forskjellige holdninger foreldre og barnehagelærere har til konkrete pedagogiske spørsmål.

source: recognise and describe some plant and animal species and sort them
nb: gjenkjenne og beskrive noen plante- og dyrearter og sortere dem

source: The main subject area deals with the measurement, calculation and analysis of figures in space.
nb: Hovedområdet handler om måling, regning og analyse av figurer i rommet.

source: In this way the individual can better learn to understand himself and others, develop competence and influence the world we live in, and be motivated to acquire insight and strive for lifelong learning.
nb: Slik kan den enkelte forstå seg selv og andre bedre, mestre og påvirke den verden vi lever i, og bli motivert til ny innsikt og livslang læring.

source: Geosciences 1, Geosciences 2 and
nb: geofag 1, geofag 2 og geofag X.

source: investigate how people exploit natural resources, other resources and technology in Norway and other countries around the world, and discuss the premises for sustainable development
nb: utforske hvordan mennesker nyttiggjør seg av naturgrunnlaget, andre ressurser og teknologi i Norge og andre land i verden, og drøfte premisser for bærekraftig utvikling

source: This main subject area deals with the structure and properties of water and aquatic solutions.
nb: Hovedområdet handler om struktur og egenskaper for vann og løsninger av stoffer i vann.

source: This means being able to select and make use of relevant information, and present one's own work using word a processing program and other presentation programs.
nb: Det betyr å kunne velge ut og gjøre seg nytte av relevant informasjon og framstille eget arbeid i tekstbehandlingsprogram og presentasjonsprogram.

source: explore and present geographic conditions and processes by using
nb: utforske og presentere geografiske forhold og prosesser ved å bruke

source: This was a problem of medium difficulty in many countries, which is evident from the international mean of 46%.
nb: Dette falt ut som en middels vanskelig oppgave i mange land, noe det internasjonale gjennomsnittet på 46 % også viser.

source: Mathematics is used to investigate the universe, systematize experience and describe and understand natural and social relations.
nb: Matematikk brukes til å utforske universet, systematisere erfaringer og beskrive og forstå naturgitte og samfunnsmessige sammenhenger.

source: Digital animations, simulations and games are good aids for stimulating creativity, and demonstrating and visualising natural science problems and research questions.
nb: For å stimulere kreativitet, levendegjøre og visualisere naturfaglige problemstillinger er digitale animasjoner, simuleringer og spill gode hjelpemidler.

source: examine and describe flowers and plants and explain the functions of the different plant parts
nb: undersøke og beskrive blomsterplanter og forklare funksjonene til de ulike plantedelene

source: Being able to do mathematics also means using and interpreting formulas and models from the real world and processing and interpreting various types of data.
nb: Å regne innebærer også å bruke og tolke formler og modeller fra virkeligheten samt bearbeide og tolke ulike typer data.

source: It is still freezing cold outside.
nb: Men fortsatt er det ganske kaldt ute.

source: The main subject area of language, literature and culture covers Norwegian, Nordic and international deaf culture.
nb: dreier seg om tegnspråkets formverk, innhold og status, og om hvordan språket og språkbruken har endret seg over tid.

source: The education shall give the pupils knowledge on the significance of their own efforts and on the informed use and development of learning strategies.
nb: Opplæringen skal gi elevene kunnskap om betydningen av egen innsats og om bevisst bruk og utvikling av læringsstrategier.

source: is about looking at language and literature from a historical and international perspective.
nb: dreier seg om å se språk og litteratur i et historisk og internasjonalt perspektiv.

source: examine functions that describe practical situations, by determining the intersection, zero, minimum or maximum and gradient, and interpret the practical value of the results
nb: undersøke funksjoner som beskriver praktiske situasjoner, ved å bestemme nullpunkt, ekstremalpunkt og skjæringspunkt og tolke den praktiske verdien av resultatene

source: To accomplish this, they need considerable support from head teachers and owners.
nb: Og de trenger mye støtte fra styrer og eier.

source: Replies from the students also emphasise that they use calculators a lot. 80% of Norwegian students reported that they used a graphing calculator or symbolic calculator when working with items in the TIMSS Advanced test.
nb: 80 % av de norske elevene rapporterte at de brukte en grafisk kalkulator eller grafisk kalkulator med symbolbehandlingsmuligheter når de arbeidet med oppgavene i TIMSS Advanced-testen.

source: It also includes adapting one’s language to a variety of conversation partners, themes and situations.
nb: Det omfatter også å tilpasse språket til ulike samtalepartnere, temaer og situasjoner.

source: master various oral roles in group discussions, lectures, dramatisations and presentations as actor and listener
nb: mestre ulike muntlige roller i gruppesamtaler, foredrag, dramatiseringer, presentasjoner og fremføringer som aktør og tilhører

source: This creates variation in their patterns of movement’, she observes.
nb: Det skaper variasjon i bevegelsesmønstrene, ser hun.

source: Each group consisted of about seven practitioners, ranging in age from 20 to 65, in addition to a researcher.
nb: Hver gruppe bestod av omtrent sju personer i alderen 20 til 65 år i tillegg til forskeren.

source: The programme subjects shall also lay the foundation for professional competence that can contribute to the industry’s continued growth and development, and teach about framework conditions and national administration of the industry.
nb: Videre skal programfagene legge grunnlaget for en yrkeskompetanse som kan bidra til fortsatt vekst og utvikling av næringen, og gi kunnskap om rammebetingelser og nasjonal forvaltning av næringen.

source: They know that this is the kindergarten’s responsibility, and they feel that they are not doing the job they were hired to do’, says Toft.
nb: De vet det er barnehagens ansvar, og de føler at de ikke gjør jobben de er satt til, sier Toft.

source: carry out investigations and use databases to search for and analyse statistical data and critically assess sources
nb: gjennomføre undersøkelser og bruke databaser til å søke etter og analysere statistiske data og vise kildekritikk

source: Who did the children like best?
nb: Hvem likte barna best?

source: The main subject area covers socialisation, personal finances, multicultural society, religion’s role in culture, forms of cohabitation and criminality.
nb: Hovedområdet omfatter sosialisering, personlig økonomi, flerkulturelle samfunn, religionens rolle i kulturen, samlivsformer og kriminalitet.

source: It also involves developing knowledge of copyright and data protection and taking a critical and independent view of different types of digital sources.
nb: Bruk av digitale verktøy kan støtte og utvikle kommunikasjonsferdigheter og presentasjoner samt åpne for nye kommunikasjonsarenaer over større avstander nasjonalt og internasjonalt.

source: Politics and democracy
nb: Politikk og demokrati

source: Knowledge of religions and philosophies of life, and the function these have as traditions and as actual sources of faith, morals and understanding life are central themes in the subject.
nb: Kunnskaper om religioner og livssyn og om den funksjon disse har både som tradisjon og som aktuelle kilder til tro, moral og livstolkning, står sentralt i faget.

source: Mathematics R2 builds on Mathematics R1, which in turn builds on Mathematics Vg1 T.
nb: Matematikk R2 bygger på matematikk R1, som igjen bygger på matematikk Vg1 T.

source: Dag Øystein Nome is associate professor at the university of Agder.
nb: Dag Øystein Nome er førsteamanuensis ved universitetet i Agder.

source: It also involves learning how to use and assess digital aids and tools for calculating, problem solving, simulation and modelling.
nb: Det handler også om å kjenne til, bruke og vurdere digitale verktøy til beregninger, problemløsning, simulering og modellering.

source: Reading includes the development of strategies to understand new words, concepts and linguistic patterns.
nb: I lesing inngår utvikling av strategier for å forstå nye ord, begreper og språklige mønstre.

source: There are competence aims in Norwegian for the Hearing Impaired after Years 2, 4, 7 and 10 at the primary and lower secondary stages, and after Levels Vg1, Vg2 and Vg3 on upper secondary general study programmes.
nb: Norsk for døve og sterkt tunghørte har kompetansemål etter 2., 4., 7., og 10. årstrinn i grunnskolen og etter Vg1, Vg2 og Vg3 i studieforberedende utdanningsprogram i videregående opplæring.

source: The transition situations, when we are going outside, are demanding in most kindergartens.
nb: Overgangssituasjonene, for eksempel når alle skal ut, er krevende i de fleste barnehager.

source: They also demonstrate and develop competence when they apply the practices of the subject, and when they reflect on how natural-science knowledge is developed.
nb: De viser og utvikler også kompetanse når de utforsker, argumenterer, analyserer og reflekterer over naturfaglige emner og sammenhenger mellom dem, og vurderer egne funn og resultater.

source: To understand and participate actively in the society we live in, it is also necessary to be able to read and collect information from reference books, newspapers and the internet, and to assess this information critically.
nb: For å forstå og delta aktivt i det samfunnet en lever i, er det også nødvendig å kunne lese og samle informasjon fra oppslagsverk, aviser og Internett og vurdere kritisk.

source: Critical assessment and analysis is also part of this main subject area.
nb: dreier seg om arbeid med tegnspråklige tekster festet til ulike medier.

source: It also involves being able to carry out and document measurements in accordance with drawings, schedules and standards.
nb: Det innebærer også å kunne gjennomføre målinger og registreringer i henhold til tegninger, skjemaer og standarder.

source: express thoughts and emotions in the encounter with English-language literature and child culture
nb: gi uttrykk for egne tanker og følelser i møte med engelskspråklig litteratur og barnekultur

source: English is used in films, literature, songs, sports, business, products, trades and entertainment, and through these channels many English words and expressions have found their way into our own language.
nb: Engelsk brukes i film, litteratur, sang, sport, handel, produkter, yrker og underholdning, og gjennom disse kanalene har mange engelske ord og uttrykk funnet veien til våre egne språk.

source: Many of the respondents wanted the children to have access to many different building materials such as building blocks, Lego and recycled materials.
nb: Mange av deltakerne i studien var opptatt av at barna skulle ha tilgang til mange forskjellige byggematerialer, som for eksempel byggeklosser, Lego og resirkulerte materialer.

source: The ability to evaluate and process own texts is also a part of such skills.
nb: Evne til å vurdere og bearbeide egne tekster er også en del av ferdigheten.

source: She is originally from Kautokeino, and she knows how hard it can be to maintain one’s Sámi language and culture.
nb: Selv er hun fra Kautokeino og vet hvor vanskelig det kan være å holde på det samiske.

source: Documentation and publication using multimedia aids is also included in this subject.
nb: Planen kan skape oversikt slik at individuelle og kollektive tiltak utfyller og støtter hverandre.

source: The main subject area is about knowing the language as a system and being able to choose strategies and work methods that are appropriate for learning the language.
nb: Hovedområdet dreier seg om å kjenne språket som system og å kunne velge strategier og arbeidsmåter som er hensiktsmessige i språkinnlæringen.

source: A total of 28 per cent of the respondents said that restrictions had been introduced in the ECEC facility out of concern for children’s safety.
nb: – I alt 28 prosent av disse fortalte om restriksjoner som er innført i barnehagen av hensyn til barnas sikkerhet.

source: discuss and elaborate on the ideal of human dignity, discrimination and the development of racism from a historical perspective with a view to the present
nb: drøfte ideal om menneskeverd, diskriminering og utvikling av rasisme i et historisk og nåtidig perspektiv

source: In the same study, the researchers received open-ended answers to questions about risk and safety measures from 879 ECEC managers.
nb: I den samme studien fikk forskerne åpne svar om risiko og sikkerhetstiltak fra 879 barnehagestyrere.

source: present an overview of the diversity of Hinduism, historic events and Hinduism's position in Norway and the world today
nb: gi en oversikt over mangfoldet i hinduismen, viktige historiske hendelser og hinduismens stilling i Norge og verden i dag

source: ‘The size of the outdoor area at the preschool, and how it is designed, have an impact on children’s activity levels.
nb: Hvor stort utemiljø barnehagene har, og hvordan det er utformet, betyr noe for barns aktivitet.

source: A key aspect of this main subject area is the development of concepts and vocabulary.
nb: Sentralt i hovedområdet er utvikling av begreper og ordforråd.

source: The high-chair is just one example.
nb: Et eksempel er barnestolen.

source: The teaching in the programme subject shall provide experience and cognition as a basis for personal growth and social development from a lifelong perspective.
nb: Opplæring i programfaget skal gi opplevelse og erkjennelse som grunnlag for personlig vekst og samfunnsmessig utfoldelse i et livslangt perspektiv.

source: The individual, society and culture
nb: Individ, samfunn og kultur

source: find and discuss probability by experimenting, simulating and calculating in day-to-day contexts and games
nb: finne og diskutere sannsynlighet gjennom eksperimentering, simulering og beregning i dagligdagse sammenhenger og spill

source: ‘Does that ever happen?’ queries Skreland.
nb: «Men skjer det, da?» spør Skreland.

source: The teaching must therefore be seen in relation to the instruction provided in other subjects and in relation to the curriculum for Norwegian.
nb: Opplæringen må derfor ses i sammenheng med opplæringen i øvrige fag og læreplanen i norsk.

source: COMMUNICATION AND CULTURE – PROGRAMME SUBJECT IN PROGRAMMES FOR SPECIALIZATION IN GENERAL STUDIES (KKM1-01)
nb: Læreplan i kommunikasjon og kultur - programfag i utdanningsprogram for studiespesialisering (KKM1-01)

source: carry out experiments with and describe hydrocarbons, alcohols and carboxylic acid and some common carbohydrates
nb: gjøre forsøk med og beskrive hydrokarboner, alkoholer og karboksylsyrer og noen vanlige karbohydrater

source: This means formulating questions and hypotheses and presenting results.
nb: Det betyr å formulere spørsmål og hypoteser og presentere resultater.

source: in Mathematics X sciences involves the ability to extract relevant mathematical information out of written text.
nb: i matematikk X innebærer å trekke matematisk relevant informasjon ut av en tekst.

source: We can discuss independently and in dialogue with others.
nb: Å drøfte kan vi gjøre selvstendig og i dialog med andre.

source: Further, it involves being able to combine texts and images when working on layouts and other visual expressions.
nb: Videre omfatter det å kunne kombinere tekst og bilder i arbeid med layout og andre visuelle uttrykk.

source: What do children really think of the adults in kindergartens?
nb: Hva mener egentlig barna om de voksne i barnehagen?

source: reflect on philosophic themes related to identity and ways of interpreting life, nature and culture, life and death, right and wrong
nb: samtale om aktuelle filosofiske og etiske spørsmål og diskutere utfordringer knyttet til temaene fattig og rik, krig og fred, natur og miljø, IKT og samfunn

source: activity can also take place in organised activities.
nb: Eksamen skal avvikles på samme tidspunkt som eksamen i Norge.

source: give an account of and carry out experiments with chromatography, distillation and recrystalization
nb: gjøre rede for og utføre kromatografi, destillasjon og omkrystallisering

source: The Swedish researcher Mia Heikkilä has for many years been interested in the gender balance in kindergartens and schools.
nb: Den svenske forskeren Mia Heikkilä har i mange år interessert seg for kjønn i barnehage og skole.

source: The teacher plans and facilitates the pupils in demonstrating their competence in various ways, including awareness, reflection and critical thinking in various contexts.
nb: Læreren skal planlegge og legge til rette for at elevene får vist kompetansen sin på varierte måter som inkluderer forståelse, refleksjon og kritisk tenkning, i ulike sammenhenger.

source: Teaching hours are in given in 60-minute units.
nb: Timetallet er oppgitt i 60-minutters enheter:

source: This main subject area focuses on socialisation, politics, economics and culture and deals with people's sense of community and differences and contrasts in a contemporary perspective.
nb: Samfunnskunnskap omfatter emnene sosialisering, politikk, økonomi og kultur og dreier seg om fellesskap og motsetninger mellom mennesker i et samtidsperspektiv.

source: create narratives about people in the past and talk about differences and similarities then and now
nb: skape fortellinger om mennesker i fortiden og snakke om forskjeller og likheter før og nå

source: involve expressing oneself in an appropriate manner and communicating with others using written language.
nb: Muntlig språk knyttes til tegnspråksituasjoner, talesituasjoner og kombinasjoner av disse.

source: explain what Tanak, Torah and Talmud are, and talk about important stories from the Jewish faith
nb: forklare hva Tanak, Tora og Talmud er og samtale om sentrale jødiske fortellinger
